<a href="https://colab.research.google.com/github/AndyZhang127/temp/blob/main/Fictional_Army_Solutions_PySpark.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
pip install pyspark

Looking in indexes: https://pypi.org/simple, https://us-python.pkg.dev/colab-wheels/public/simple/
Collecting pyspark
  Downloading pyspark-3.3.0.tar.gz (281.3 MB)
     |████████████████████████████████| 281.3 MB 43 kB/s
Collecting py4j==0.10.9.5
  Downloading py4j-0.10.9.5-py2.py3-none-any.whl (199 kB)
     |████████████████████████████████| 199 kB 61.3 MB/s
Building wheels for collected packages: pyspark
  Building wheel for pyspark (setup.py) ... done
  Created wheel for pyspark: filename=pyspark-3.3.0-py2.py3-none-any.whl size=281764026 sha256=17eb4894efe7bc9643b1726d304d2f3c02409cfb36afd4ed482301cb92db0a73
  Stored in directory: /root/.cache/pip/wheels/7a/8e/1b/f73a52650d2e5f337708d9f6a1750d451a7349a867f928b885
Successfully built pyspark
Installing collected packages: py4j, pyspark
Successfully installed py4j-0.10.9.5 pyspark-3.3.0

In [2]:
# Step 1.Import the necessary libraries
import pandas as pd
from pyspark.sql import SparkSession

spark=SparkSession.builder.appName("EX1").getOrCreate()
spark

In [3]:
# Step 2.This is the data given as a dictionary
raw_data = {'regiment': ['Nighthawks', 'Nighthawks', 'Nighthawks', 'Nighthawks', 'Dragoons', 'Dragoons', 'Dragoons', 'Dragoons', 'Scouts', 'Scouts', 'Scouts', 'Scouts'],
            'company': ['1st', '1st', '2nd', '2nd', '1st', '1st', '2nd', '2nd','1st', '1st', '2nd', '2nd'],
            'deaths': [523, 52, 25, 616, 43, 234, 523, 62, 62, 73, 37, 35],
            'battles': [5, 42, 2, 2, 4, 7, 8, 3, 4, 7, 8, 9],
            'size': [1045, 957, 1099, 1400, 1592, 1006, 987, 849, 973, 1005, 1099, 1523],
            'veterans': [1, 5, 62, 26, 73, 37, 949, 48, 48, 435, 63, 345],
            'readiness': [1, 2, 3, 3, 2, 1, 2, 3, 2, 1, 2, 3],
            'armored': [1, 0, 1, 1, 0, 1, 0, 1, 0, 0, 1, 1],
            'deserters': [4, 24, 31, 2, 3, 4, 24, 31, 2, 3, 2, 3],
            'origin':['Arizona', 'California', 'Texas', 'Florida', 'Maine', 'Iowa', 'Alaska','Nighthawks','Dragoons','Washington','Scouts','Wyoming'],

            }

In [4]:
raw_data_df=pd.DataFrame(data=raw_data)
raw_data_df

,regiment,company,deaths,battles,size,veterans,readiness,armored,deserters,origin
0,Nighthawks,1st,523,5,1045,1,1,1,4,Arizona
1,Nighthawks,1st,52,42,957,5,2,0,24,California
2,Nighthawks,2nd,25,2,1099,62,3,1,31,Texas
3,Nighthawks,2nd,616,2,1400,26,3,1,2,Florida
4,Dragoons,1st,43,4,1592,73,2,0,3,Maine
5,Dragoons,1st,234,7,1006,37,1,1,4,Iowa
6,Dragoons,2nd,523,8,987,949,2,0,24,Alaska
7,Dragoons,2nd,62,3,849,48,3,1,31,Nighthawks
8,Scouts,1st,62,4,973,48,2,0,2,Dragoons
9,Scouts,1st,73,7,1005,435,1,0,3,Washington
10,Scouts,2nd,37,8,1099,63,2,1,2,Scouts
11,Scouts,2nd,35,9,1523,345,3,1,3,Wyoming

In [5]:
# Step 3. Create a dataframe and assign it to a variable called army.
army=spark.createDataFrame(data=pd.DataFrame(data=raw_data))
army.show()

+----------+-------+------+-------+----+--------+---------+-------+---------+----------+
|  regiment|company|deaths|battles|size|veterans|readiness|armored|deserters|    origin|
+----------+-------+------+-------+----+--------+---------+-------+---------+----------+
|Nighthawks|    1st|   523|      5|1045|       1|        1|      1|        4|   Arizona|
|Nighthawks|    1st|    52|     42| 957|       5|        2|      0|       24|California|
|Nighthawks|    2nd|    25|      2|1099|      62|        3|      1|       31|     Texas|
|Nighthawks|    2nd|   616|      2|1400|      26|        3|      1|        2|   Florida|
|  Dragoons|    1st|    43|      4|1592|      73|        2|      0|        3|     Maine|
|  Dragoons|    1st|   234|      7|1006|      37|        1|      1|        4|      Iowa|
|  Dragoons|    2nd|   523|      8| 987|     949|        2|      0|       24|    Alaska|
|  Dragoons|    2nd|    62|      3| 849|      48|        3|      1|       31|Nighthawks|
|    Scouts|    1st|    62|      4| 973|      48|        2|      0|        2|  Dragoons|
|    Scouts|    1st|    73|      7|1005|     435|        1|      0|        3|Washington|
|    Scouts|    2nd|    37|      8|1099|      63|        2|      1|        2|    Scouts|
|    Scouts|    2nd|    35|      9|1523|     345|        3|      1|        3|   Wyoming|
+----------+-------+------+-------+----+--------+---------+-------+---------+----------+

In [ ]:
# Step 4.Set the 'origin' colum as the index of the dataframe

In [6]:
# Step 5.Print only the column veterans
army.select("veterans").show()

+--------+
|veterans|
+--------+
|       1|
|       5|
|      62|
|      26|
|      73|
|      37|
|     949|
|      48|
|      48|
|     435|
|      63|
|     345|
+--------+

In [7]:
# Step 6. Print the columns 'veterans' and 'deaths'
army.select("veterans","deaths").show()

+--------+------+
|veterans|deaths|
+--------+------+
|       1|   523|
|       5|    52|
|      62|    25|
|      26|   616|
|      73|    43|
|      37|   234|
|     949|   523|
|      48|    62|
|      48|    62|
|     435|    73|
|      63|    37|
|     345|    35|
+--------+------+

In [8]:
# Step 7. Print the name of all the columns
army.columns

['regiment',
 'company',
 'deaths',
 'battles',
 'size',
 'veterans',
 'readiness',
 'armored',
 'deserters',
 'origin']

In [9]:
# Step 8. Select the 'deaths', 'size' and 'deserters' columns from Maine and Alaska
origins=["Maine","Alaska"]
cols=["deaths","size","deserters"]
army.select(cols).filter(army.origin.isin(origins)).show()

+------+----+---------+
|deaths|size|deserters|
+------+----+---------+
|    43|1592|        3|
|   523| 987|       24|
+------+----+---------+

In [10]:
# Step 9. Select the rows 3 to 7 and the columns 3 to 6
army.select(army.columns[2:6]).collect()[2:7]

[Row(deaths=25, battles=2, size=1099, veterans=62),
 Row(deaths=616, battles=2, size=1400, veterans=26),
 Row(deaths=43, battles=4, size=1592, veterans=73),
 Row(deaths=234, battles=7, size=1006, veterans=37),
 Row(deaths=523, battles=8, size=987, veterans=949)]

In [11]:
# Step 10. Select every row after the fourth row and all columns
army.collect()[3:]

[Row(regiment='Nighthawks', company='2nd', deaths=616, battles=2, size=1400, veterans=26, readiness=3, armored=1, deserters=2, origin='Florida'),
 Row(regiment='Dragoons', company='1st', deaths=43, battles=4, size=1592, veterans=73, readiness=2, armored=0, deserters=3, origin='Maine'),
 Row(regiment='Dragoons', company='1st', deaths=234, battles=7, size=1006, veterans=37, readiness=1, armored=1, deserters=4, origin='Iowa'),
 Row(regiment='Dragoons', company='2nd', deaths=523, battles=8, size=987, veterans=949, readiness=2, armored=0, deserters=24, origin='Alaska'),
 Row(regiment='Dragoons', company='2nd', deaths=62, battles=3, size=849, veterans=48, readiness=3, armored=1, deserters=31, origin='Nighthawks'),
 Row(regiment='Scouts', company='1st', deaths=62, battles=4, size=973, veterans=48, readiness=2, armored=0, deserters=2, origin='Dragoons'),
 Row(regiment='Scouts', company='1st', deaths=73, battles=7, size=1005, veterans=435, readiness=1, armored=0, deserters=3, origin='Washington'),
 Row(regiment='Scouts', company='2nd', deaths=37, battles=8, size=1099, veterans=63, readiness=2, armored=1, deserters=2, origin='Scouts'),
 Row(regiment='Scouts', company='2nd', deaths=35, battles=9, size=1523, veterans=345, readiness=3, armored=1, deserters=3, origin='Wyoming')]

In [12]:
# Step 11. Select every row up to the 4th row and all columns
army.collect()[:4]

[Row(regiment='Nighthawks', company='1st', deaths=523, battles=5, size=1045, veterans=1, readiness=1, armored=1, deserters=4, origin='Arizona'),
 Row(regiment='Nighthawks', company='1st', deaths=52, battles=42, size=957, veterans=5, readiness=2, armored=0, deserters=24, origin='California'),
 Row(regiment='Nighthawks', company='2nd', deaths=25, battles=2, size=1099, veterans=62, readiness=3, armored=1, deserters=31, origin='Texas'),
 Row(regiment='Nighthawks', company='2nd', deaths=616, battles=2, size=1400, veterans=26, readiness=3, armored=1, deserters=2, origin='Florida')]

In [13]:
# Step 12. Select the 3rd column up to the 7th column
army.select(army.columns[2:7]).show(5)

+------+-------+----+--------+---------+
|deaths|battles|size|veterans|readiness|
+------+-------+----+--------+---------+
|   523|      5|1045|       1|        1|
|    52|     42| 957|       5|        2|
|    25|      2|1099|      62|        3|
|   616|      2|1400|      26|        3|
|    43|      4|1592|      73|        2|
+------+-------+----+--------+---------+
only showing top 5 rows

In [14]:
# Step 13. Select rows where df.deaths is greater than 50
army.filter("deaths>50").show()

+----------+-------+------+-------+----+--------+---------+-------+---------+----------+
|  regiment|company|deaths|battles|size|veterans|readiness|armored|deserters|    origin|
+----------+-------+------+-------+----+--------+---------+-------+---------+----------+
|Nighthawks|    1st|   523|      5|1045|       1|        1|      1|        4|   Arizona|
|Nighthawks|    1st|    52|     42| 957|       5|        2|      0|       24|California|
|Nighthawks|    2nd|   616|      2|1400|      26|        3|      1|        2|   Florida|
|  Dragoons|    1st|   234|      7|1006|      37|        1|      1|        4|      Iowa|
|  Dragoons|    2nd|   523|      8| 987|     949|        2|      0|       24|    Alaska|
|  Dragoons|    2nd|    62|      3| 849|      48|        3|      1|       31|Nighthawks|
|    Scouts|    1st|    62|      4| 973|      48|        2|      0|        2|  Dragoons|
|    Scouts|    1st|    73|      7|1005|     435|        1|      0|        3|Washington|
+----------+-------+------+-------+----+--------+---------+-------+---------+----------+

In [15]:
# Step 14. Select rows where df.deaths is greater than 500 or less than 50
# 1.solution1
army.where((army.deaths>500) | (army.deaths <50)).show()

+----------+-------+------+-------+----+--------+---------+-------+---------+-------+
|  regiment|company|deaths|battles|size|veterans|readiness|armored|deserters| origin|
+----------+-------+------+-------+----+--------+---------+-------+---------+-------+
|Nighthawks|    1st|   523|      5|1045|       1|        1|      1|        4|Arizona|
|Nighthawks|    2nd|    25|      2|1099|      62|        3|      1|       31|  Texas|
|Nighthawks|    2nd|   616|      2|1400|      26|        3|      1|        2|Florida|
|  Dragoons|    1st|    43|      4|1592|      73|        2|      0|        3|  Maine|
|  Dragoons|    2nd|   523|      8| 987|     949|        2|      0|       24| Alaska|
|    Scouts|    2nd|    37|      8|1099|      63|        2|      1|        2| Scouts|
|    Scouts|    2nd|    35|      9|1523|     345|        3|      1|        3|Wyoming|
+----------+-------+------+-------+----+--------+---------+-------+---------+-------+

In [16]:
# 2.solution2
army.filter((army.deaths>500) | (army.deaths <50)).show()

+----------+-------+------+-------+----+--------+---------+-------+---------+-------+
|  regiment|company|deaths|battles|size|veterans|readiness|armored|deserters| origin|
+----------+-------+------+-------+----+--------+---------+-------+---------+-------+
|Nighthawks|    1st|   523|      5|1045|       1|        1|      1|        4|Arizona|
|Nighthawks|    2nd|    25|      2|1099|      62|        3|      1|       31|  Texas|
|Nighthawks|    2nd|   616|      2|1400|      26|        3|      1|        2|Florida|
|  Dragoons|    1st|    43|      4|1592|      73|        2|      0|        3|  Maine|
|  Dragoons|    2nd|   523|      8| 987|     949|        2|      0|       24| Alaska|
|    Scouts|    2nd|    37|      8|1099|      63|        2|      1|        2| Scouts|
|    Scouts|    2nd|    35|      9|1523|     345|        3|      1|        3|Wyoming|
+----------+-------+------+-------+----+--------+---------+-------+---------+-------+

In [17]:
from numpy import isnat
# Step 15. Select all the regiments not named "Dragoons"
filters=["Dragoons"]
army.where(army.regiment != "Dragoons").show()

+----------+-------+------+-------+----+--------+---------+-------+---------+----------+
|  regiment|company|deaths|battles|size|veterans|readiness|armored|deserters|    origin|
+----------+-------+------+-------+----+--------+---------+-------+---------+----------+
|Nighthawks|    1st|   523|      5|1045|       1|        1|      1|        4|   Arizona|
|Nighthawks|    1st|    52|     42| 957|       5|        2|      0|       24|California|
|Nighthawks|    2nd|    25|      2|1099|      62|        3|      1|       31|     Texas|
|Nighthawks|    2nd|   616|      2|1400|      26|        3|      1|        2|   Florida|
|    Scouts|    1st|    62|      4| 973|      48|        2|      0|        2|  Dragoons|
|    Scouts|    1st|    73|      7|1005|     435|        1|      0|        3|Washington|
|    Scouts|    2nd|    37|      8|1099|      63|        2|      1|        2|    Scouts|
|    Scouts|    2nd|    35|      9|1523|     345|        3|      1|        3|   Wyoming|
+----------+-------+------+-------+----+--------+---------+-------+---------+----------+

In [18]:
# Step 16. Select the rows called Texas and Arizona
origins=["Texas","Arizona"]
army.where(army.origin.isin(origins)).show()

+----------+-------+------+-------+----+--------+---------+-------+---------+-------+
|  regiment|company|deaths|battles|size|veterans|readiness|armored|deserters| origin|
+----------+-------+------+-------+----+--------+---------+-------+---------+-------+
|Nighthawks|    1st|   523|      5|1045|       1|        1|      1|        4|Arizona|
|Nighthawks|    2nd|    25|      2|1099|      62|        3|      1|       31|  Texas|
+----------+-------+------+-------+----+--------+---------+-------+---------+-------+

In [19]:
# Step 17. Select the third cell in the row named Arizona
army.filter(army.origin=='Arizona').select(army.columns[2]).show()

+------+
|deaths|
+------+
|   523|
+------+

In [20]:
# Step 18. Select the third cell down in the column named deaths
army.select("deaths").collect()[2]

Row(deaths=25)